# pandas.melt

pandas.melt(frame, id_vars=None, value_vars=None, var_name=None, value_name='value', col_level=None, ignore_index=True)

Unpivot a DataFrame from wide to long format, optionally leaving identifiers set.

This function is useful to massage a DataFrame into a format where one or more columns are identifier variables (id_vars), while all other columns, considered measured variables (value_vars), are “unpivoted” to the row axis, leaving just two non-identifier columns, ‘variable’ and ‘value’.

In [ ]:
import pandas as pd

In [ ]:
df = pd.DataFrame({'A':{0:'a',1:'b',2:'c'},
                   'B':{0:1,1:2,2:3},
                   'C':{0:'ESRAA',1:'ESSO',2:'SASA'}})

In [ ]:
df

   A  B      C
0  a  1  ESRAA
1  b  2   ESSO
2  c  3   SASA

In [ ]:
df1=pd.melt(df,id_vars=['A'])

In [ ]:
df1

   A variable  value
0  a        B      1
1  b        B      2
2  c        B      3
3  a        C  ESRAA
4  b        C   ESSO
5  c        C   SASA

In [ ]:
df2=pd.melt(df,id_vars=['A'],value_vars=['B','C'])

In [ ]:
df2

   A variable  value
0  a        B      1
1  b        B      2
2  c        B      3
3  a        C  ESRAA
4  b        C   ESSO
5  c        C   SASA

In [ ]:
df3=pd.melt(df,id_vars=['A'],value_vars=['B'])

In [ ]:
df3

   A variable  value
0  a        B      1
1  b        B      2
2  c        B      3

In [ ]:
df3=pd.melt(df,id_vars=['A'],value_vars=['C'],var_name='Hello',value_name='MyName')

In [ ]:
df3

   A Hello MyName
0  a     C  ESRAA
1  b     C   ESSO
2  c     C   SASA

In [ ]:
df3=pd.melt(df,id_vars=['A'],value_vars=['B','C'],var_name='Hello',value_name='MyName',ignore_index=True)

In [ ]:
df3

   A Hello MyName
0  a     B      1
1  b     B      2
2  c     B      3
3  a     C  ESRAA
4  b     C   ESSO
5  c     C   SASA